pimple/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -0.05;
xmax  0.05;
ymin  -0.15;
ymax  0.15;
zmin  -0.04;
zmax  0.08;

vertices
(
    (  $xmin  $ymin  $zmin  )
    (  $xmax  $ymin  $zmin  )
    (  $xmax  $ymax  $zmin  )
    (  $xmin  $ymax  $zmin  )
    (  $xmin  $ymin  $zmax )
    (  $xmax  $ymin  $zmax )
    (  $xmax  $ymax  $zmax )
    (  $xmin  $ymax  $zmax )
);

blocks
(
    // hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1 1 1)
    hex (0 1 2 3 4 5 6 7) (20 20 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    allBoundary
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
