pimple/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    auto0
    {
        type            patch;
        nFaces          5977;
        startFace       38156;
    }
    auto1
    {
        type            patch;
        nFaces          264;
        startFace       44133;
    }
    auto2
    {
        type            patch;
        nFaces          260;
        startFace       44397;
    }
)

// ************************************************************************* //
