pimple/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    auto1
    {
		type				groovyBC;
		variables (
			"freq=5;"
			"amp=0.002;"
			"vel=0.010;"
		);
		valueExpression		"vector (0,vel+(2*pi*freq*amp*sin(2*pi*freq*time())),0)";
        value uniform      (0 0 0);
    }
    auto2
    {
        type            zeroGradient;
    }
    auto0
    {
        type            noSlip;
    }
}


// ************************************************************************* //
