pimple/0/s
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      s;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    auto0
    {
        type            zeroGradient;
    }

    auto1
    {
        type            fixedValue;
        value           uniform 1;
    }

    auto2
    {
        type  inletOutlet;
        value uniform 0;
        inletValue uniform 0;
    }
}

// ************************************************************************* //
